# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [128, 3, 2]] # 0-P1/2  # c2, kerenl, stride
  - [-1, 1, Conv, [128, 3, 1]] # 1-P2/4
  - [-1, 2, C3k2, [128, False, 0.25]] # 16x320x320
  - [-1, 1, FDConv, [128, 3, 1, 1]] # 1-P2/4 1, 32, 3, 1, 1

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [256, False, 0.25]] # 32x160x160
  - [-1, 1, FDConv, [256, 3, 1, 1]] # 32x160x160
  
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, FDConv, [512, 3, 1, 1]] 
  - [-1, 1, SPPF, [512, 5]] # 10
  - [-1, 2, C2PSA, [512]] # 11

# YOLO11n head
head:
  - [[-1, 7], 1, Fusion, [1]] # 12
  - [-1, 2, C3k2, [512, False]] # 13

  - [3, 1, Conv, [512, 3, 2]] # 14
  - [6, 1, Conv, [512, 1, 1]] # 15
  - [[-1, -2], 1, Fusion, [1]] # 16
  - [-1, 2, C3k2, [512, False]] # 17 # 128x160x160

  - [13, 1, nn.Upsample, [None, 2, "nearest"]] #18 # 128x160x160
  - [[-1, 17], 1, Fusion, [1]] # 19
  - [-1, 2, C3k2, [512, False]] # 20 # 128x160x160

  - [17, 1, SCDown, [512, 3, 2]] # 21 #128x80x80
  - [[-1, 13], 1, Fusion, [1]] # 22
  - [-1, 2, C3k2, [512, False]] # 23 # 64x80x80

  - [[20, 23], 1, Detect, [nc]] # Detect(P3, P4, P5)
